Import Files

In [3]:
import pandas as pd

In [4]:
vanorder = pd.read_csv('vanorder.csv')
vaninterest = pd.read_csv('vaninterest.csv')

Exploratory Data Analysis

In [5]:
vanorder.head()

,idvanOrder,order_status,order_subset,requestor_client_id,servicer_auth,total_price,order_datetime,txCreate
0,1,2,A,1,199.0,84,2017-04-18 15:30:00,2017-04-18 00:46:44
1,2,2,A,2,97.0,163,2017-04-18 07:10:00,2017-04-18 06:42:40
2,3,2,A,3,15.0,149,2017-04-18 07:10:00,2017-04-18 06:44:09
3,4,3,A,4,NaN,84,2017-04-18 11:10:00,2017-04-18 07:23:30
4,5,2,A,5,211.0,127,2017-04-18 09:00:00,2017-04-18 07:27:42

In [6]:
vaninterest.head()

,idvanInterest,idvanOrder,order_subset_assigned,servicer_auth,txCreate
0,1,1,A,199,2017-04-18 05:06:00
1,2,2,A,97,2017-04-18 06:43:00
2,3,3,A,15,2017-04-18 06:59:00
3,4,5,A,211,2017-04-18 07:32:00
4,5,6,A,4,2017-04-18 07:45:00

In [43]:
vanorder.describe()

,idvanOrder,order_status,requestor_client_id,servicer_auth,total_price
count,300.000000,300.000000,300.000000,283.000000,300.000000
mean,150.500000,2.066667,117.970000,141.851590,205.376667
std,86.746758,0.287223,70.540074,81.918914,171.365502
min,1.000000,2.000000,1.000000,1.000000,20.000000
25%,75.750000,2.000000,53.750000,71.500000,120.000000
50%,150.500000,2.000000,117.500000,141.000000,167.000000
75%,225.250000,2.000000,180.250000,212.500000,228.750000
max,300.000000,5.000000,243.000000,282.000000,1710.000000

Convert date into Pandas datetime object

In [7]:
vanorder.txCreate = pd.to_datetime(vanorder.txCreate)
vaninterest.txCreate = pd.to_datetime(vaninterest.txCreate)

In [8]:
vanorder.head()

,idvanOrder,order_status,order_subset,requestor_client_id,servicer_auth,total_price,order_datetime,txCreate
0,1,2,A,1,199.0,84,2017-04-18 15:30:00,2017-04-18 00:46:44
1,2,2,A,2,97.0,163,2017-04-18 07:10:00,2017-04-18 06:42:40
2,3,2,A,3,15.0,149,2017-04-18 07:10:00,2017-04-18 06:44:09
3,4,3,A,4,NaN,84,2017-04-18 11:10:00,2017-04-18 07:23:30
4,5,2,A,5,211.0,127,2017-04-18 09:00:00,2017-04-18 07:27:42

Q) 5 : What is the order fulfillment rate, i.e. percentage of orders that was completed ?

In [9]:
len(vanorder[vanorder.order_status == 2])/len(vanorder)

0.94

Order Fulfillment rate = 94%

Subset Order type- A

In [10]:
vanorderA = vanorder[vanorder.order_subset == 'A']
vaninterestA = vaninterest[vaninterest.order_subset_assigned == 'A']

Create a new column matchtime i.e difference of time accepted and time created

In [33]:
vanorderA['txAccept'] = vaninterestA.txCreate
vanorderA['matchtime'] = vanorderA.txAccept - vanorderA.txCreate
vanorderA.head()

c:\users\pramodksh\appdata\local\programs\python\python36-32\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
c:\users\pramodksh\appdata\local\programs\python\python36-32\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

,idvanOrder,order_status,order_subset,requestor_client_id,servicer_auth,total_price,order_datetime,txCreate,matchtime,txAccept
0,1,2,A,1,199.0,84,2017-04-18 15:30:00,2017-04-18 00:46:44,04:19:16,2017-04-18 05:06:00
1,2,2,A,2,97.0,163,2017-04-18 07:10:00,2017-04-18 06:42:40,00:00:20,2017-04-18 06:43:00
2,3,2,A,3,15.0,149,2017-04-18 07:10:00,2017-04-18 06:44:09,00:14:51,2017-04-18 06:59:00
3,4,3,A,4,NaN,84,2017-04-18 11:10:00,2017-04-18 07:23:30,00:08:30,2017-04-18 07:32:00
4,5,2,A,5,211.0,127,2017-04-18 09:00:00,2017-04-18 07:27:42,00:17:18,2017-04-18 07:45:00

Subset Advanced/Immediate orders

In [36]:
van_advanced_orders = vanorderA[(vanorderA.matchtime.between('00:00:00', '01:00:00') )]

In [38]:
van_advanced_orders = van_advanced_orders[van_advanced_orders.matchtime < '01:00:00']

In [39]:
van_advanced_orders.head()

,idvanOrder,order_status,order_subset,requestor_client_id,servicer_auth,total_price,order_datetime,txCreate,matchtime,txAccept
1,2,2,A,2,97.0,163,2017-04-18 07:10:00,2017-04-18 06:42:40,00:00:20,2017-04-18 06:43:00
2,3,2,A,3,15.0,149,2017-04-18 07:10:00,2017-04-18 06:44:09,00:14:51,2017-04-18 06:59:00
3,4,3,A,4,NaN,84,2017-04-18 11:10:00,2017-04-18 07:23:30,00:08:30,2017-04-18 07:32:00
4,5,2,A,5,211.0,127,2017-04-18 09:00:00,2017-04-18 07:27:42,00:17:18,2017-04-18 07:45:00
5,6,2,A,6,4.0,117,2017-04-18 08:30:00,2017-04-18 07:43:05,00:28:55,2017-04-18 08:12:00

Q)6 (a) What is the average match time, by immediate/advanced orders?

In [40]:
van_advanced_orders.matchtime.mean()

Timedelta('0 days 00:08:59.451612')

Average matchtime is 8 Minutes 59 sec

Q)6 (b) What is the median match time, by immediate/advanced orders?

In [41]:
van_advanced_orders.matchtime.median()

Timedelta('0 days 00:05:06')

Median matchtime is 5 Minutes 06 sec

  (c) Which of the above one do you think provides a better representation the data, i.e. a better metric for tracking our performance in matching?

Median gives a better metric because it doesn't get affected by outliers.(In this case midnight orders).

However mean of binned hours would provide better insights.(Avg matchtime of morning hours,afternnon,evening and night)

Export the file as a csv to prepeare dashnoard(Tableau)

In [42]:
van_advanced_orders.to_csv('1.csv')

Dashboard for Management

<img src="dashboard_for_management.jpg">

Dashboard for Operations :

<img src="dashboard_for_operations.jpg">